let datamap = {};

// ---- MOCK ----
let mockdata = {
    "name": "post-2022-05",
    "column": [
        "交易序號", "交易日期", "交易時間", "交易店名",
        "交易商品類別", "交易數量", "金額小計", "會員編號",
        "支付類別"
    ],
    "meta": [
        "id", "date", "time", "id",
        "category", "number", "number", "id",
        "category"
    ],
    "weight": [1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0],
    "sample": `,2022-05-01,06:07:42,燕巢新民店,一般日報,2,20,,現金
,2022-05-25,06:09:03,梓官蚵仔寮店,一般日報,2,20,,現金
,2022-05-31,07:13:20,高雄真大港店,一般日報,2,20,,現金
,2022-05-02,12:27:28,高雄文橫店,一般日報,2,20,,現金
,2022-05-09,08:27:09,高雄真大港店,一般日報,2,20,,現金
,2022-05-25,08:20:47,大樹水興店,一般日報,2,20,,現金
,2022-05-04,14:38:35,梓官蚵仔寮店,一般日報,2,20,,現金
,2022-05-04,14:29:10,高雄真大港店,一般日報,2,20,,現金
,2022-05-10,12:19:26,梓官蚵仔寮店,一般日報,2,20,,現金
,2022-05-16,06:06:34,梓官蚵仔寮店,一般日報,2,20,,現金
,2022-05-13,17:50:02,仁武五和店,咖啡,2,90,,現金
,2022-05-15,10:01:12,仁武五和店,咖啡,2,90,,現金
,2022-05-31,06:58:42,鳳山華興店,咖啡,2,90,,現金
,2022-05-13,13:36:58,高雄大坪頂店,咖啡,2,90,,現金
,2022-05-31,15:46:10,阿蓮忠孝店,咖啡,2,90,,現金
,2022-05-10,17:15:31,湖內大湖店,咖啡,2,90,,現金
,2022-05-16,09:33:34,高雄醫學店,咖啡,2,90,,現金
,2022-05-14,08:55:21,高雄德中店,咖啡,2,90,,現金
,2022-05-16,22:27:54,高雄清豐店,咖啡,2,90,,現金
,2022-05-09,23:20:43,高雄清豐店,咖啡,2,90,,現金`.split("\n").map((r) => r.split(","))
};

function uploadData(data, cb){
    if(data["name"] in datamap){
        cb(false);
    }else{
        datamap[data["name"]] = data;
        cb(true);
    }
}
function listData(cb){
    // cb(Object.keys(datamap));
    // ---- MOCK ----
    cb([
        "post-2022-05",
        "post-2022-06",
        "post-2022-07",
        "post-2022-08",
        "post-2022-09",
        "post-2022-10",
        "post-2022-11",
        "post-2022-12",
        "post-2023-01",
        "post-2023-02",
        "post-2023-03",
        "post-2023-04"
    ]);
}
function getData(name, cb){
    // cb(datamap[name]);
    // ---- MOCK ----
    cb(mockdata);
}
function editData(name, data, cb){
    datamap[name] = data;
    cb(true);
}
function removeData(name, cb){
    delete datamap[name];
    cb(true);
}